abbreviation
ability
abstract
abuse
academic
access
accessible
accidents
accommodation
accommodations
accountants
accounting
accuracy
accurate
achievement
acid
action
actions
activities
activity
actor
addition
additional
address
adequate
administrator
adult
adults
advance
advanced
advantages
advertisement
advertisements
advertising
advice
affairs
Africa
African
age
agencies
agency
agriculture
aids
aim
air
airport
Alaska
allergic
allergy
alley
allowance
alternative
amazing
ambiguous
ambition
America
American
amount
analysis
ancient
anger
angry
animal
animals
ankle
announcement
antibiotics
apartment
ape
apes
apostrophe
appeal
appearance
applicants
application
applied
appointment
approach
approaches
appropriate
approval
April
archaeological
architecture
area
areas
argument
army
arrival
art
article
articles
artistic
Asia
assessment
assignment
assignments
assistance
assistant
association
astronomy
Athens
atmospheric
attacks
attempts
attendance
attention
attentive
audience
audio
August
Australia
Australian
Australians
author
authority
available
Avenue
average
award
aware
awareness
awful
background
bacteria
badge
badminton
baldness
balloon
ballroom
band
bands
bank
banking
barbecue
barren
basic
basis
bath
bathroom
beach
beard
beats
beautiful
beauty
bedroom
beds
bedsit
beginners
beginning
behavior
belts
benefits
Berlin
bibliography
bicycle
bicycles
bill
biological
biology
birds
Birmingham
birth
black
blanket
blind
blocks
blond
blood
blouse
board
boat
bones
book
booking
booklet
booklist
books
bookshelf
bookshop
boot
boots
bowling
bowls
branch
break
breakfast
breath-taking
breeding
bridge
Bristol
Britain
British
brochures
brothers
building
buildings
burger
burglar
bus
business
cab
cabinet
cable
cafe
cafeteria
cages
Cambridge
camera
camp
campus
Canadian
candidate
candle
candles
capital
car
carbon
card
cards
care
career
carpet
carving
case
cash
cashier
cassette
cassettes
castle
casual
catalog
catering
cattle
cause
causes
cave
caves
CD
CD-ROM
center
central
centre
century
certificate
certificates
chair
challenging
chance
chancellor
channel
chapter
chapters
charge
charges
charity
chart
chat
cheaper
check
checks
cheerful
cheese
chemist
chemistry
chest
chicks
child
childcare
children
children's
chin
Chinese
chocolate
choice
choices
church
Church
cinema
circle
cities
city
class
classical
classmates
classroom
clean
cleaner
cleaning
clear
clever
client
clients
cliff
clock
close-up
cloth
clothes
clothing
club
clubs
co-operation
co-operative
coastal
cocktail
code
coffee
cola
colleagues
collection
college
colleges
color
com
comedy
comfortable
commercials
commission
common
communication
community
commuter
commuters
companies
companion
company
complaint
complete
composition
compulsory
computer
computers
concert
concessions
conclusion
condition
conditions
conference
confidence
confident
confirmation
conqueror
conquest
conservation
construction
consultant
consumption
contact
contacts
container
contaminants
content
contents
contracts
control
controversy
convenient
conversation
cooking
cooperation
cop
copy
corporation
corpse
correspondence
cost
costly
costs
costume
cot
cottage
cotton
cough
council
countries
country
countryside
course
cover
craft
cramming
cream
credit
creeks
crime
crisis
critical
crocodile
crocodiles
crops
cultivation
cultural
culture
cup
cupboard
cups
curly
currency
current
curriculum
curtains
customer
customers
cycle
cycling
daily
damage
damages
dancer
danger
dangerous
dark
data
date
deadline
debt
December
decision
decline
decoration
decorations
dedication
degree
delay
delegate
delivery
demonstration
dentist
department
departmental
dependent
deposit
depression
depth
description
desert
design
designer
desire
desk
destination
detail
detailed
details
deteriorate
development
dial
dialogue
diary
dictation
diet
difference
different
difficult
difficulties
difficulty
dining
dinner
dioxide
diploma
diplomas
direct
director
disabled
disagreement
disco
discount
discovery
discussion
disease
diseases
dishes
disposal
disputes
distance
distant
distribution
disturbance
divorce
doctor
doctors
documents
dollars
domestic
dominant
donation
donations
doors
double
draft
drama
drawer
draws
dress
dressing
drinking
drinks
driver
driving
drop
drop-off
drop-out
dropout
drowsiness
drugs
duration
dust
duties
duty
Eagle
eastern
economics
economy
editor
education
educational
effect
effective
effectively
effects
efficient
Egyptian
elbow
elder
electricity
elements
email
embassy
emergencies
emergency
emotion
emperor
employee
employees
employer
employment
empty
encyclopedia
ending
energies
energy
engine
engineer
engineering
engineers
England
enhance
enormous
enquiry
enrollment
entertainment
enthusiasm
entrance
environment
environmental
epidemic
equipment
essay
essential
Europe
European
evening
event
evidence
exaggerate
exam
examination
example
examples
exams
exception
exchange
excitement
exciting
excursion
excuse
exercise
exhibition
existence
existent
existing
expansion
expectancy
expenses
expensive
experience
experienced
experiment
experimental
experiments
expert
expire
explosion
export
exposure
extension
extensive
extra
eyesight
fabric
facilities
facility
factories
factors
factory
faculty
failure
falcons
familiar
families
family
famous
fancy
fare
farm
farmers
farming
farms
fashion
favor
favorite
feature
features
fee
feedbacks
fees
feet
female
ferries
festival
fever
fiber
field
fifth
figures
film
filmed
final
finance
financial
finding
fine
fingers
fire
firm
firms
first-aid
fish
fishing
fitness
flag
flash
flat
flats
flexible
flight
floors
flour
flourishment
flower
flowers
fly
focus
folder
food
foot
Forbes
foreign
forest
forestry
form
formal
former
forms
formula
fortnight
fossils
foyer
France
fraud
freedom
French
frequency
frequent
Friday
fridge
fruit
full-time
fund-raising
fur
furniture
further
future
gap
garage
garden
gender
general
genetic
geographic
geography
German
Germany
gesture
girlfriend
glass
global
goals
gold
golf
goods
government
government-funded
governments
grade
graduates
grain
grammar
grants
grass
Greece
green
Green
ground
group
groups
growth
guest
guests
guidance
guide
guitar
guy
gym
habit
habits
hall
hand
handball
handbook
handling
handout
handy
harbor
hard-hoofed
hard-working
harmful
hat
hats
headache
heading
headmaster
health
healthcare
heart
heartbeat
heater
heavy
height
helmet
helpline
hens
herb
hero
heroine
high-rise
higher
highly-trained
hints
hiring
historian
historical
history
hits
hobbies
holiday
homework
horse
horses
hospital
hotel
house
households
housekeeping
housing
human
humans
hunt
hunting
ice
idea
ideas
identification
identities
ieltswang
ignorance
illegal
illness
image
immune
impact
important
imports
impossible
improvement
in
inability
inaccurate
inadequate
incoming
independence
index
Indian
individual
industrial
industry
infection
influence
information
informative
initial
injection
injury
inland
innovation
inquiries
insect
insects
insomnia
inspiring
institute
institutes
institution
institutions
instruction
instructors
instrument
instruments
insurance
intact
intelligence
intelligent
intensive
interest
intermediate
internal
international
internet
Internet
intervention
interview
interviewee
interviewer
interviews
introduction
investigation
investigators
investment
irregular
irrigation
irritable
island
isolated
isolation
issue
issues
Italy
item
items
jacket
jam
January
Japanese
jeans
jewelry
job
jobs
journal
journalist
juice
July
junction
June
junior
kangaroo
keepers
kelp
key
keys
keywords
kids
killer
kilograms
kindergarten
King
kit
kitchen
kits
knife
knowledge
koalas
lab
laboratory
lack
lake
lakes
lamp
land
landlady
landlady's
landscape
language
laser
latest
lava
law
lawyer
layer
layout
learn
least
lecture
lecturer
leisure
lemon
lender
length
leprosy
lessons
letter
level
levels
libraries
library
lifestyle
lift
light
lights
likelihood
line
linguistics
link
lions
list
literature
loan
loans
local
location
locations
lock
London
loss
lounge
low-risk
loyal
luck
lunch
machine
machines
magazine
magic
magnificent
maid
mail
mails
main
maintenance
major
majority
majors
making
malaria
Malaysia
male
management
manager
map
March
margin
market
marketing
marks
martial
mass
master
matching
material
materials
mathematic
mathematics
mature
maximum
May
meal
meals
measure
measurement
measurements
meat
media
medical
medicine
medium
meeting
Melbourne
membership
memorise
mental
metal
method
methods
microbiology
microfilm
microphone
mid
mid-day
mid-morning
mid-semester
midmorning
midnight
migration
migratory
mileage
miles
milk
million
mills
mine
minimum
mining
minutes
miserable
mixture
mobile
model
modern
Monday
money
monologue
monopoly
month
mood
mosquito
mother
motivation
motorcycle
mountain
moustache
movie
movies
muscles
museum
music
musical
nap
narrator
national
nationalities
nationality
natural
nature
naught
neck
neighboring
nervous
nets
network
newsletters
newspaper
newspapers
night
noble
noise
noisy
non-drinker
non-medicine
normal
note-taking
notebook
notes
notice
November
nurse
nursery
nursing
nuts
objective
objectives
observation
occasion
occupants
occupation
occupational
ocean
October
offer
office
officer
OHP
oil
Olympic
online
open-book
opportunities
optic
option
optional
options
oral
order
ordinary
organic
organization
organizer
orientation
original
outline
overall
overhead
overseas
ownership
Oxford
Pacific
package
pages
painkillers
painting
pair
pal
palace
Palm
panic
paper
papers
parcel
parent
parental
parents
park
parking
part-time
participants
parties
party
passage
passengers
passport
patients
pattern
patterns
payable
payment
peasants
pence
penicillin
pennies
penny
pension
pensioners
per
percent
percentage
perfect
performance
performers
period
perks
permit
person
personal
personality
personnel
pet
petrol
pets
PHD
phone
phone-in
photocopies
photocopy
photograph
photographs
photojournalism
photos
physical
physically
pianist
piano
picnic
picture
pictures
pie
pills
pink
place
placement
places
plan
planner
planners
planning
plant
planting
plants
plastic
player
playground
pleasant
pleasure
plus
pocket
point
police
polish
political
pollution
pool
pop
popular
population
position
positions
positive
post
postcode
postgraduate
potential
pottery
pounds
power
practical
practice
precautions
precious
precision
predictable
preference
prepare
preposition
present
presentation
presentations
pressure
prevention
previous
price
printed
printing
priorities
priority
privacy
private
prizes
problems
process
processing
product
production
products
profession
professional
professions
professor
profit
profits
program
project
projector
promising
prone
property
prospectus
protein
psychiatric
psycholinguistics
psychological
psychology
public
publication
pump
pure
purest
purpose
purse
qualification
qualifications
quality
quarter
Queen's
questionnaire
questions
radio
railway
raincoat
rainfall
rainwater
random
range
rank
rapid
rare
rat
rate
raw
readers
reading
reason
reasons
recall
reception
receptionist
recipe
recommendation
record
recorder
recording
records
recreation
recruit
recycled
recycling
redundant
referee
referees
reference
reflectance
reform
refreshment
refreshments
refund
region
regional
register
registration
regular
regularly
regulation
regulations
rehearsal
reinforced
related
relations
relationship
relaxation
relevant
reliable
relief
religion
remark
removal
renewal
rent
rental
repair
repetition
replacement
report
reports
representative
requirement
research
reservation
reserve
residence
residents
resistance
resistant
resource
resources
respondents
response
responsibility
restaurant
restaurants
result
results
retails
retirement
return
reverse
review
revision
rice
riders
rising
risks
rivers
road
robber
robots
rock
rocks
role
room
roommate
route
rows
royal
rubber
rubbish
rule
rules
rural
Russia
s
safari
safe
safety
sailing
salad
salary
sale
sales
sample
sandwich
satellite
satisfaction
Saturday
saving
savings
scale
scandals
scar
scarce
schedule
scholarship
school
science
scientific
scientists
score
Scotland
Scotsman
script
sculpture
seafood
season
seasoned
seat
seats
second
second-hand
secondary
secretary
section
selection
self-defense
self-discipline
self-funded
self-sufficient
semester
seminar
senior
sense
sensible
sentences
September
serial
serious
service
session
setting
settlement
seven-screen
several
sewage
sewer
sex
sharp
shear
sheep
sheet
shelf
shell
shelter
shift
ship
shoes
shop
shoplifters
shoppers
shopping
short
shortage
shuttle
sick
sickness
side
sight
sign
signature
silence
silent
silver
similar
simple
site
sites
size
sizes
skating
skiing
skill
skills
skin
skirt
slang
sleep
sleeping
sleepy
slim
slip
smelly
smoke
smokers
smoking
snacks
social
soil
solar
solution
solve
sound
soundproof
source
sources
souvenirs
space
Spain
Spanish
spare
speaker
speaking
special
species
specific
speech
speed
spending
spider
spiral
sponsor
spoons
sport
sports
sportsman
sportswear
spot
stability
staff
stage
stairs
standard
standards
star
starter
starting
statement
states
station
stations
statistics
status
steady
steak
steam
steel
steering
steps
stern
stock
stomach
stone
stones
store
storehouse
stores
story
strategy
street
strength
stress
stressful
strike
stronger
student
studies
study
stuff
style
styles
subcommittee
subject
subjective
subjects
submit
subtitle
subtitles
suburb
successful
sufficient
sugar
suggestion
suggestions
suit
suitable
summary
summer
Sunday
sundial
sunlight
supermarket
supervisor
supply
support
surface
surname
surprise
surroundings
survey
survival
sweater
sweaters
swimming
switch
Sydney
syndicate
system
systematic
systems
table
tables
tablets
tape
taxi
tea
teacher
teaching
team
teams
technical
techniques
technology
teeth
telephone
telescope
television
temper
temperature
temple
temples
tennis
term
terms
test
text
textbook
texture
theatre
theft
theoretical
theory
therapist
therapy
thief
thinking
third
thought
thoughts
thousand
threats
thriller
Thursday
ticket
tickets
tiles
timber
timetable
title
tones
tools
top
topic
topics
total
touching
tour
touring
tourism
tourist
tourists
tours
towel
tower
town
toys
track
tractor
trade
traditional
traffic
train
training
trains
transfer
transport
transportation
travel
travelers
traveling
treatment
tree
trees
trends
tribe
tributes
Trinity
trip
trolley
trouble
trousers
tube
Tuesday
tuition
tune
tunnels
turning
tutor
tutorial
tutorials
TV
type
types
typical
unanimous
uncomfortable
unconvincing
undergraduate
underground
understanding
unemployment
unfair
unhealthy
uniform
union
Union
unique
United
universities
unreliable
unsocial
unusual
urchin
usage
useful
useless
usual
utensils
vacancies
vacancy
vacation
vaccine
vacuum
value
variety
various
vegetable
vegetarian
vegetation
velvet
veterinarian
video
videos
videotape
view
village
violent
virtual
virtually
visa
visas
visible
visitors
visual
vocabulary
vocation
volunteer
volunteers
waiter
waitress
walking
wall
walls
warm
warming
washing
Washington
waste
watchdog
water
water-clock
water-proof
water-skiing
waterfall
wave
wax
wealth
weapon
wear
weather
website
wedding
Wednesday
weeds
weekdays
weekend
weekends
weekly
weight
welfare
West
western
westerner
wetland
whales
wheel
wheels
wide
width
wildlife
willow
wind
window
wing
wise
Wollongong
wood
woods
words
worker
working
workload
workshop
workshops
world
worthwhile
writer
writing
X-ray
yellow
Yen
yoga
York
youngster
youth
zero
zoo